import 'package:teacher_test/contents/contents.dart';

class KoreanAcheive22{
  List<String> koreanAcheiveListen12 = [
  '중요한 내용이나 일이 일어난 순서를 고려하며 듣고 말한다.',
  '바르고 고운 말로 서로의 감정을 나누며 듣고 말한다.',
  '상대의 말을 집중하여 듣고 말차례를 지키며 대화한다.',
  '자신의 경험이나 생각을 바른 자세로 발표한다.',
  '듣기와 말하기에 관심과 흥미를 가진다.'
  ];
  List<String> koreanAcheiveRead12 = [
  '글자, 단어, 문장, 짧은 글을 정확하게 소리 내어 읽는다.',
  '의미가 잘 드러나도록 문장과 짧은 글을 알맞게 띄어 읽는다.',
  '글을 읽고 중심 내용을 확인한다.',
  '인물의 마음이나 생각을 짐작하고 이를 자신과 비교하며 글을 읽는다.',
  '읽기에 흥미를 가지고 즐겨 읽는 태도를 지닌다.'
  ];
  List<String> koreanAcheiveWrite12 = [
  '글자와 단어를 바르게 쓴다.',
  '쓰기에 흥미를 가지며 자신의 생각이나 느낌을 문장으로 표현한다.',
  '주변 소재에 대해 소개하는 글을 쓴다.',
  '겪은 일을 표현하는 글을 자유롭게 쓰고, 쓴 글을 함께 읽고 생각이나 느낌을 나눈다.'
  ];
  List<String> koreanAcheiveGram12 = [
  '한글 자모의 이름과 소릿값을 알고 정확하게 발음하고 쓴다.',
  '소리와 표기가 다를 수 있음을 알고 단어를 바르게 읽고 쓴다.',
  '문장과 문장 부호를 알맞게 쓰고 한글에 호기심을 가진다.'
  ];
  List<String> koreanAcheiveLiterature12 = [
  '말놀이, 낭송 등을 통해 말의 재미와 즐거움을 느낀다.',
  '작품을 듣거나 읽으면서 느끼거나 생각한 점을 말한다.',
  '작품 속 인물의 모습, 행동, 마음을 상상하여 시, 노래, 이야기, 그림 등으로 표현한다.',
  '시나 노래, 이야기에 흥미를 가진다.'
  ];
  List<String> koreanAcheiveMedia12 = [
  '일상의 다양한 매체와 매체 자료에 흥미와 관심을 가진다.',
  '일상의 경험과 생각을 글과 그림으로 표현한다.',
  ];
  //2022 국어 1~2학년 성취기준
  List<String>
}